In [1]:
import pandas as pd 
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
data= pd.read_csv('sep19SexAndAgeAddedFINAL DATASET_ver2.txt') 
print(data.shape)

(535169, 406)

In [3]:
#Filter the data

# dataMain=dataMain.query('FIELD_15 !=1 and FIELD_16 !=1 and FIELD_17 !=1 and FIELD_22 != 1 and FIELD_23 != 1 and FIELD_24 != 1 and FIELD_30 != 1')

#remove diabetic people 
data=data[data.FIELD_16!=1]
data=data[data.FIELD_23!=1]

#remove hypertensive people who are diagnosed and on drugs
# data=data[data.FIELD_15!=1]
# data=data[data.FIELD_22!=1]

#remove people who are diagnosed and on drugs for high lipids  
# data=data[data.FIELD_17!=1]
# data=data[data.FIELD_24!=1]

print(data.shape)

(8938, 406)

In [4]:
newdata=data.copy()
print(newdata.shape)
newdata.head()

(8938, 406)

,Unnamed: 0,FIELD_1,FIELD_2,COMPARE,AGE,B_DAY,SEX,FIELD_3,FIELD_4,FIELD_5,...,S004423,S004424,S005200,S007400,S008501,S008502,S008503,S008504,S010101,S010102
274,274,1000651,20151007,100065120151007,48.0,670204.0,1.0,1,1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,12.0
275,275,1000651,20160908,100065120160908,49.0,670204.0,1.0,NaN,1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10.0,9.0
276,276,1000651,20170428,100065120170428,50.0,670204.0,1.0,1,1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,13.0
277,277,1000651,20180503,100065120180503,51.0,670204.0,1.0,1,1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,12.0
315,315,1000766,20160528,100076620160528,49.0,670203.0,0.0,NaN,2,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.0,13.0

In [5]:
# for checking if there are two records per day
newdata_count_temp=newdata.groupby(by=['FIELD_1','FIELD_2']).size().reset_index(name='freq') 
# print(newdata_count_temp[newdata_count_temp.freq>1])

# group records by id and year to find out the number of tests per specific year
newdata_count_temp['Year']=(newdata_count_temp.FIELD_2 / 10000).astype(int)
newdata_count_peryear=newdata_count_temp.groupby(by=['FIELD_1','Year']).size().reset_index(name='freq')
# max(temp[temp.freq>1].freq)
newdata_count_peryear=newdata_count_peryear.sort_values(by='FIELD_1')
newdata_count_peryear.head()

# to get the number of years a patient visited
newdata_count_peryearG1= newdata_count_peryear.groupby(by=['FIELD_1']).size().reset_index(name='freq')
newdata_count_peryearG1.head()
print(newdata_count_peryearG1.freq.unique())
newdata_count_peryearG1=newdata_count_peryearG1[newdata_count_peryearG1.freq>1]
print(newdata_count_peryearG1.shape)
newdata_count_peryearG1.head()

[1 4 2 3 5 6]
(1410, 2)

    FIELD_1  freq
1      1364     4
3      2308     4
15   365690     2
18   381742     2
21   401963     2

In [6]:
mylist=[]
for i in newdata_count_peryearG1.FIELD_1:
    vals=newdata_count_peryear[newdata_count_peryear.FIELD_1==i]
    mylist.append([i,np.sort(list(vals.Year))])

In [7]:
mylistPD=pd.DataFrame(mylist,columns=['FIELD_1','Years'])
print(mylistPD.shape)
mylistPD.tail(10)

(1410, 2)

      FIELD_1         Years
1400  5246750  [2017, 2018]
1401  5276679  [2017, 2018]
1402  5293566  [2017, 2018]
1403  5305815  [2017, 2018]
1404  5329515  [2017, 2018]
1405  5329548  [2017, 2018]
1406  5338162  [2017, 2018]
1407  5338168  [2017, 2018]
1408  5343345  [2017, 2018]
1409  5418066  [2017, 2018]

In [8]:
newdata['Year']=(newdata.FIELD_2 / 10000).astype(int)

x=[]
target=[]

for _id in mylistPD.FIELD_1:
    ID=_id
    years=mylistPD[mylistPD.FIELD_1==ID].Years.values

    for y in range(len(years[0])-1):
        dif=years[0][y+1] - years[0][y]
        if(dif==1):
            
            tempdata=newdata.query('FIELD_1=='+str(ID)+' and Year=='+str(years[0][y])).reset_index()         
            x.append(tempdata.iloc[tempdata.shape[0]-1,:].values)

            tempdata=newdata.query('FIELD_1=='+str(ID)+' and Year=='+str(years[0][y+1])).reset_index()         
            target.append(tempdata.iloc[tempdata.shape[0]-1,:].values)

In [9]:
newdata.head()

,Unnamed: 0,FIELD_1,FIELD_2,COMPARE,AGE,B_DAY,SEX,FIELD_3,FIELD_4,FIELD_5,...,S004424,S005200,S007400,S008501,S008502,S008503,S008504,S010101,S010102,Year
274,274,1000651,20151007,100065120151007,48.0,670204.0,1.0,1,1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,12.0,2015
275,275,1000651,20160908,100065120160908,49.0,670204.0,1.0,NaN,1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10.0,9.0,2016
276,276,1000651,20170428,100065120170428,50.0,670204.0,1.0,1,1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,13.0,2017
277,277,1000651,20180503,100065120180503,51.0,670204.0,1.0,1,1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,12.0,2018
315,315,1000766,20160528,100076620160528,49.0,670203.0,0.0,NaN,2,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.0,13.0,2016

In [10]:
# print(list(newdata.columns))

newcollist=newdata.columns
newcollist= np.insert(newcollist,0,'index')
newcollist

Index(['index', 'Unnamed: 0', 'FIELD_1', 'FIELD_2', 'COMPARE', 'AGE', 'B_DAY',
       'SEX', 'FIELD_3', 'FIELD_4',
       ...
       'S004424', 'S005200', 'S007400', 'S008501', 'S008502', 'S008503',
       'S008504', 'S010101', 'S010102', 'Year'],
      dtype='object', length=408)

In [11]:
newdata.shape
tempcols=newcollist
# print(list(newdata.columns))

In [12]:
xlable=pd.DataFrame(x,columns=tempcols).drop(columns='Unnamed: 0')
xlable.tail(10)

,index,FIELD_1,FIELD_2,COMPARE,AGE,B_DAY,SEX,FIELD_3,FIELD_4,FIELD_5,...,S004424,S005200,S007400,S008501,S008502,S008503,S008504,S010101,S010102,Year
1422,354320,5246750,20170525,524675020170525,48.0,690429.0,0.0,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,19.0,19.0,2017
1423,357304,5276679,20170621,527667920170621,51.0,660313.0,0.0,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,15.0,16.0,2017
1424,358171,5293566,20170626,529356620170626,52.0,651018.0,1.0,NaN,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.0,13.0,2017
1425,360300,5305815,20170720,530581520170720,43.0,740506.0,0.0,1,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.0,13.0,2017
1426,360985,5329515,20170708,532951520170708,47.0,700714.0,1.0,1,3.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,17.0,19.0,2017
1427,361011,5329548,20170708,532954820170708,47.0,700309.0,1.0,NaN,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,11.0,11.0,2017
1428,362209,5338162,20170719,533816220170719,59.0,580311.0,0.0,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,13.0,2017
1429,362215,5338168,20170719,533816820170719,49.0,680616.0,0.0,1,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,15.0,13.0,2017
1430,362894,5343345,20170723,534334520170723,60.0,571224.0,1.0,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16.0,14.0,2017
1431,371037,5418066,20170922,541806620170922,43.0,740707.0,0.0,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017

In [13]:
targelable=pd.DataFrame(target,columns=tempcols).drop(columns='Unnamed: 0')
targelable.tail(10)

,index,FIELD_1,FIELD_2,COMPARE,AGE,B_DAY,SEX,FIELD_3,FIELD_4,FIELD_5,...,S004424,S005200,S007400,S008501,S008502,S008503,S008504,S010101,S010102,Year
1422,354321,5246750,20180530,524675020180530,49.0,690429.0,0.0,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,17.0,17.0,2018
1423,357305,5276679,20180412,527667920180412,52.0,660313.0,0.0,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,15.0,18.0,2018
1424,358172,5293566,20180618,529356620180618,53.0,651018.0,1.0,1,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,13.0,2018
1425,360301,5305815,20180612,530581520180612,44.0,740506.0,0.0,1,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,11.0,2018
1426,360986,5329515,20180427,532951520180427,48.0,700714.0,1.0,NaN,3.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.0,14.0,2018
1427,361012,5329548,20180609,532954820180609,48.0,700309.0,1.0,NaN,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.0,14.0,2018
1428,362210,5338162,20180315,533816220180315,60.0,580311.0,0.0,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,18.0,19.0,2018
1429,362216,5338168,20180523,533816820180523,50.0,680616.0,0.0,NaN,2.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16.0,15.0,2018
1430,362895,5343345,20180428,534334520180428,61.0,571224.0,1.0,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.0,11.0,2018
1431,371038,5418066,20180525,541806620180525,44.0,740707.0,0.0,1,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018

In [14]:
print(xlable.shape)
print(targelable.shape)

(1432, 407)
(1432, 407)

In [16]:
# targelable.to_csv('_targelable4_withNa_AllColumns_OnDrugForLipid.txt',sep=',')
# xlable.to_csv('_xlable4_withNa_AllColumns_OnDrugForLipid.txt',sep=',')

In [ ]:
print(xlable.shape)
print(targelable.shape)